### Data Cleaning

In [1]:
import numpy as np
import pandas as pd

In [2]:
mydata={'me':[3,2,np.NaN],'myfriend':[5,4,36],'myotherfriend':[4,np.NaN,np.NaN]}

In [3]:
mydataframe = pd.DataFrame(mydata)

In [4]:
mydataframe

    me  myfriend  myotherfriend
0  3.0         5            4.0
1  2.0         4            NaN
2  NaN        36            NaN

In [5]:
mydataframe.dropna()

    me  myfriend  myotherfriend
0  3.0         5            4.0

In [6]:
mydataframe.fillna(value = 'lc')

    me  myfriend myotherfriend
0  3.0         5           4.0
1  2.0         4            lc
2   lc        36            lc

In [7]:
mydataframe.fillna(value=mydataframe['myotherfriend'].mean())

    me  myfriend  myotherfriend
0  3.0         5            4.0
1  2.0         4            4.0
2  4.0        36            4.0

In [8]:
newdata = {
    'movies':['star-wars','titanic','pitbull','rrr'],
    'viewers':['me','me','bob','alix'],
    'ratings':[2,3,5,2]
    
}

In [9]:
newdata

{'movies': ['star-wars', 'titanic', 'pitbull', 'rrr'],
 'viewers': ['me', 'me', 'bob', 'alix'],
 'ratings': [2, 3, 5, 2]}

In [10]:
movieframe=pd.DataFrame(newdata)

In [11]:
movieframe

      movies viewers  ratings
0  star-wars      me        2
1    titanic      me        3
2    pitbull     bob        5
3        rrr    alix        2

In [12]:
movieframe.groupby('movies').mean()

           ratings
movies
pitbull        5.0
rrr            2.0
star-wars      2.0
titanic        3.0

In [13]:
movieframe.groupby('movies').describe()

          ratings
            count mean std  min  25%  50%  75%  max
movies
pitbull       1.0  5.0 NaN  5.0  5.0  5.0  5.0  5.0
rrr           1.0  2.0 NaN  2.0  2.0  2.0  2.0  2.0
star-wars     1.0  2.0 NaN  2.0  2.0  2.0  2.0  2.0
titanic       1.0  3.0 NaN  3.0  3.0  3.0  3.0  3.0